Revit 2027 API
MacroModuleIterator.GetCurrent Method
 Returns the current Macro.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Macro GetCurrent()
Public Function GetCurrent As Macro
public:
Macro^ GetCurrent()
member GetCurrent : unit -> Macro
Return Value
Macro
 The current Macro.
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
See Also
Reference
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace